// EmojiPicker.js
import React from 'react';

const emojis = [
    '😀', '😂', '😍', '😎', '😢', '😡', '👍', '👎', '🎉', '❤️', '🔥', '✨', '🌈', '🌍', '🎈',
    '😇', '🤔', '🙄', '😏', '🤗', '😴', '🥳', '🤪', '🤩', '😜', '😝', '😋', '😱', '😨', '😰',
    '🤯', '😬', '🤮', '😷', '😇', '🥰', '🤤', '😇', '😛', '😤', '🥺', '😳', '🥵', '🥶', '🤓',
    '🧐', '😎', '🤥', '🤡', '🤠', '😺', '😸', '😹', '😻', '😼', '😽', '🙀', '😿', '😾', '💪', 
    '👊', '✊', '👏', '🙌', '👐', '🤲', '🤝', '🙏', '💅', '👂', '👃', '👀', '👁', '👅', '👄',
    '👶', '👦', '👧', '👨', '👩', '👴', '👵', '👨‍⚕️', '👩‍⚕️', '👨‍🎓', '👩‍🎓', '👨‍🏫', '👩‍🏫', 
    '👨‍🏭', '👩‍🏭', '👨‍💼', '👩‍💼', '👨‍🔧', '👩‍🔧', '👨‍🍳', '👩‍🍳', '👨‍🎤', '👩‍🎤', '👨‍🍼', '🍕','🍔','🍟','🌭',
    '👩‍🍼', '👨‍🚀', '👩‍🚀', '👨‍⚖️', '👩‍⚖️', '🎅', '🤶', '🦸‍♂️', '🦸‍♀️', '🦹‍♂️', '🦹‍♀️', 
    '🧙‍♂️', '🧙‍♀️', '🧛‍♂️', '🧛‍♀️', '🧜‍♂️', '🧜‍♀️', '🧝‍♂️', '🧝‍♀️', '🧙', '🧚', '🧛', 
    '🧜', '🧝', '🤳', '💃', '🕺', '👯‍♂️', '👯‍♀️', '🕴', '🗣', '👤', '👥', '👫', '👬', '👭', 
    '💏', '💑', '👪', '👨‍👩‍👦', '👨‍👩‍👧', '👨‍👩‍👧‍👦', '👩‍👩‍👦', '👩‍👩‍👧', '👩‍👩‍👧‍👦', '🧂',
    '👨‍👨‍👦', '👨‍👨‍👧', '👨‍👨‍👧‍👦'
];

const EmojiPicker = ({ onSelect }) => {
    return (
        <div style={{
            position: 'absolute',
            background: 'white',
            border: '1px solid #ccc',
            borderRadius: '5px',
            padding: '10px',
            zIndex: 1000,
            display: 'flex',
            flexWrap: 'wrap',
            width: '569px',
            maxHeight: '150px', // Added maxHeight
            overflowY: 'scroll' // Added overflowY
        }}>
        
            {emojis.map((emoji, index) => (
                <span
                    key={index}
                    onClick={() => onSelect(emoji)}
                    style={{ fontSize: '44px', cursor: 'pointer', margin: '5px' }}
                >
                    {emoji}
                </span>
            ))}
        </div>
    );
};

export default EmojiPicker;